Revit 2027 API
BarTerminationsData.GetDocument Method
 Gets the document containing the hook type ids, end treatment ids and crank type ids.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetDocument()
Public Function GetDocument As Document
public:
Document^ GetDocument()
member GetDocument : unit -> Document
Return Value
Document
 Returns the document containing the hook type ids, end treatment ids and crank type ids.
See Also
Reference
BarTerminationsData Class
Autodesk.Revit.DB.Structure Namespace